#### Reshaping Data using Melt and Pivot
---

##### `melt()` --- wide to long
The melt() method in Pandas is used to unpivot a DataFrame from wide format to long format. In other words, it takes columns that represent different values and combined them into key-value pairs (i.e., long-form data).

##### When to Use `melt()`:
- When you have DataFrame where each row is an observation, and each colum represents a different variable or measurement,and you want to reshape the data into a longer format fr easier analyssis or visualization.


**Syntax:**
```Python
df.melt(id_vars=None, value_vars=None, var_name=None, value_name="value", col_level=None)
```

**Parameters**
- `id_vars`: The columns that you want to keep fixed (these columns will remain as identifiers).
- `value_vars`: The columns you want to unpivot (The ones you want to "melt" into single column).
- `var_name`: The name to use for the new column that will contain the names of the melted columns (default is `variable`).
- `value_name`: The name to use for the new column that will contain the values from the melted columns (default is `value`).
- `col_level`: Used for multi-level column DataFrames.

**Example:**

In [1]:
import pandas as pd

# sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}

df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

**Using `melt()`:**

If we want to "melt" the DataFrame so that ach row represents a student-subject pair, we can do:

In [8]:
melted_df = df.melt(id_vars=["Name"], value_vars=['Math', 'Science', 'English'], var_name='Subject', value_name="Marks")
melted_df

      Name  Subject  Marks
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

##### Explanation:
- `id_vars=["Name"]`: We keep the "Name" column as it is because it's the identifier.
- `value_vars=['Math', 'Science', 'English']`: Thse are the columns we want to melt.
- `var_name="Subject"`: The new column containing the names of the subjects.
- `value_name="Marks"`: The new column containing the score.

##### Why Use `melt()` ?
- Data normalization: Helps in transforming data for statistical modeling and data visualization.
- Pivot tables: Many times, plotting functions or statistical models work better with long-format data.

This is useful for converting columns into rows — perfect for plotting or tidy data
formats.

---

##### `pivot()` --- Long to wide
The `pivot()` function in Pandas is used to reshape data, specifically to turn longformat data into wide-format data. This is the reverse operation of melt() .

##### How it works:
- `pivot()` takes a long-format DataFrame and turns it into a wide-format DataFrame by specifying which columns will become the new columns, the rows, and the values.

##### Syntax:
```Python 
df.pivot(index=None, columns=None, values=None)
```

##### Parameters:
- `index` : The column whose unique values will become the rows of the new DataFrame.
- `columns` : The column whose unique values will become the columns of the new DataFrame.
- `values` : The column whose values will fill the new DataFrame. These will become the actual data (values in the table).

In [10]:
melted_df.pivot(index=["Name"], columns="Subject", values="Marks")

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

##### Explanation:
- `index="Name"` : The unique values in the “Name” column will become the rows in the new DataFrame.
- `columns="Subject"` : The unique values in the “Subject” column will become the columns in the new DataFrame.
- `values="Score"` : The values from the “Score” column will populate the table.

##### Why use pivot() ?
1. Better data structure: It makes data easier to analyze when you have
categories that you want to split into multiple columns.
2. Easier visualization: Often, you want to represent data in a format where categories are split across columns (for example, when creating pivot tables for reporting).
3. Aggregating data: You can perform aggregations (like sum , mean , etc.) to group values before pivoting.

##### Important Notes:
- **Duplicate Entries**: If you have multiple rows with the same combination of index and columns , `pivot()` will raise an error. In such cases, you should use `pivot_table()` (which can handle duplicate entries by aggregating them).

##### Example of `pivot_table()` to handle duplicates:

In [11]:
data = {
    "Name":["Alice", "Alice", "Alice", "Bob", "Bob"],
    "Subject":["Math", "Math", "Science", "Math", "Math"],
    "Score":[85, 80, 90, 78, 82]
}

df = pd.DataFrame(data)

df

    Name  Subject  Score
0  Alice     Math     85
1  Alice     Math     80
2  Alice  Science     90
3    Bob     Math     78
4    Bob     Math     82

We can use `pivot_table()` to aggregate values (e..g. taking the mean for the duplicate entries):

In [13]:
df.pivot_table(index="Name", columns="Subject", values="Score", aggfunc="mean")

Subject  Math  Science
Name
Alice    82.5     90.0
Bob      80.0      NaN